[
  {
    "path": "posts/2020-03-10-specific-gravity/",
    "title": "Understanding Specific Gravity and Extract",
    "description": "Het originele artikel van Manning. De grafieken zijn door mij zo goed mogelijk gereproduceerd.",
    "author": [
      {
        "name": "Martin P. Manning",
        "url": "https://www.morebeer.com/brewingtechniques/library/backissues/issue1.3/manning.html"
      }
    ],
    "date": "2022-01-29",
    "categories": [
      "rekenen"
    ],
    "contents": "\r\nRepublished from BrewingTechniques' September/October 1993.\r\nUnderstanding the basis of extract potential enables you to refine your method, fine-tune your bill of materials, and ensure success in achieving the beer you seek. Simple conversion charts make easy work of converting specific gravity to degree extract and back again.\r\nBrewers use two primary systems for measuring the amount of extract or alcohol dissolved in wort or beer – specific gravity and percent extract by weight. Because published methods, recipes, and product information often provide extract data in only one of the two possible forms, knowing how to convert from one system to the other provides a powerful tool for recipe design. This article defines and explains the two main systems for measuring extract and provides the tools that will enable you to convert from one system to the other, calculate extract yield, and make adjustments to your brewing process.\r\nSpecific Gravity\r\nSpecific gravity is the density (weight per unit volume) of a substance divided by the density of water. A specific gravity (SG) of 1.050 (\"50 points\") indicates that the substance is 5% heavier than an equal volume of water. The specific gravity of liquids is often measured with a hydrometer, whose weight (a constant) displaces different volumes of liquid as the liquid’s density varies. The typical hydrometer consists of a weighted bulb with a slender graduated stem rising above it. Once the bulb is submerged, the increment of displacement with depth is determined only by the cross section of the stem, which must be very small to ensure a high degree of accuracy.\r\nVariation with temperature: The densities of water and wort vary with temperature. When using specific gravity in speaking or writing, reference temperatures for the wort sample and for water must be specified along with the value of specific gravity. A wort may have, for example, a specific gravity of 1.050 at 60°F (15.5°C) relative to water at 60°F, or 1.050 at 60°F/60°F (1.050 at 15.5°C/15.5°C). The density of water peaks at 39°F (4°C), and that temperature is sometimes used as a reference temperature for the density of water. Brewers use reference temperatures closer to room (cellar?) temperature. The wort reference temperature and water reference temperature are always the same, so the measured specific gravity of wort with no extract content is 1.000. It is therefore sufficient to say that a given wort has a specific gravity of 1.050 at 60°F, the convention used in this article. Typical reference temperatures are 60°F (15.5°C), 64°F (17.5°C), and 68°F (20°C).\r\nReadings taken when the wort or beer is at a temperature other than the reference temperature can be adjusted back to the reference temperature, and some hydrometers have a built-in thermometer and correction read-out. Alternatively, a correction table or curve, usually supplied with the instrument, can be used to adjust readings. Such corrections must include the test sample's change in density with temperature and also the change in the volume of the instrument itself. Strictly speaking, the necessary wort density adjustment is a function of the extract content and temperature (1), but this is a small effect. If the correction data assumes a nominal extract content, the error is at most 0.0002 (0.2 points) in specific gravity, if the sample is 10°F (5.5°C from the reference temperature. This diminishes to zero as the sample is brought to the reference temperature.\r\nPercent Extract by Weight - Plato and Balling Scales\r\nTables constructed in 1843 by the German chemist Karl Balling, and later improved upon by Plato for the German Imperial Commission, correlate specific gravity with the percent by weight of extract as sucrose in solution. Of the common sugars, sucrose produces the largest increase in specific gravity for a given percentage by weight in solution. Both tables were derived by making up solutions of sucrose (cane sugar) in water – each solution containing different percentages by weight – and weighing a known volume of the resulting solutions to determine their densities. Plato’s table is slightly more accurate than Balling’s, but for practical purposes they are the same. Stating that a wort is 10 degrees Plato (or Balling) means that if the extract in solution were 100% sucrose, it would be 10% of the total weight. In the typical wort, however, only a small fraction of the extract is actually sucrose. This is not a problem; sucrose was merely selected as the reference because it produces the largest increase in specific gravity for a given percentage by weight in solution. Had another, “lighter” sugar been selected, sucrose would, confusingly, yield more than 100% of its weight as extract (see below). Throughout the following discussion, degrees P will be used to indicate the percent by weight of extract in solution.\r\nMeasuring extract using the Plato scale: A hydrometer that is calibrated in degrees Plato (degrees P) is properly called a saccharometer, because it directly measures the percent sugar as sucrose by weight in solution. Degrees Plato do not vary with temperature, because the weight of the water and of the extract contained in the water do not vary. The statement that a wort is 10 degrees P, therefore, needs no accompanying reference temperature. When measuring extract using the Plato scale, however, the wort must be at the reference temperature. Otherwise, a correction must be applied because the saccharometer is still comparing a weight to a displaced volume. Adjustments are made in the same way as for instruments that measure specific gravity.\r\nRelationship between Specific Gravity and Degrees Plato\r\nAlthough the Plato and Balling tables were derived empirically, approximate conversion formulas can be found. Roughly, for specific gravity at 60°F (15.5°C),\r\n\\[\\begin{equation}\r\n  P = (SG - 1)/0.004\r\n   \\tag{1}\r\n\\end{equation}\\]\r\nor\r\n\\[\\begin{equation}\r\n  P = SG_{points}/4 \\text{ and converseley, } SG_{points} = 4 \\cdot P\r\n   \\tag{2}\r\n\\end{equation}\\]\r\nA much more accurate, yet still easily calculated conversion, also for specific gravity at 60 degrees F (15.5 degrees C), is given by\r\n\\[\\begin{equation}\r\n  P = 259 - \\frac{259}{SG} \\text{ or } SG = \\frac{259}{259 - P}\r\n   \\tag{3}\r\n\\end{equation}\\]\r\nThis form is given by Clerck (1995) for specific gravity at 17.5°C, using 260 instead of 259 as the constant in the equation. I have found the value 259 to give good accuracy for specific gravity at 60°F (15.5°C).\r\nWhen extreme accuracy is desired, a polynomial curve fit to the table values can be derived using linear regression techniques. I obtained the following third-degree fit using a table that charts specific gravity at 60°F (15.5°C) against the percentage (w/w) (measured in degrees Plato) found in Hough, Briggs, and Stevens (1971):\r\n\\[\\begin{equation}\r\n  P = -676.67 + 1286.4 \\cdot SG - 800.47 \\cdot S{G^2} + 190.74 \\cdot S{G^3}\r\n   \\tag{4}\r\n\\end{equation}\\]\r\nThe curves shown in Figure 1 were generated using equation (4) and provide a graphical means of accurate conversion between specific gravity and degrees Plato.\r\nFigure 2 shows the relative accuracies of the three conversion equations (1), (3), and (4). For most purposes, equation (3) is adequate and much preferred over equation (1), especially at high specific gravities.\r\nApplications\r\nWeight of extract in solution: The weight of extract, WE (as sucrose), per unit volume of solution can be calculated as\r\n\\[\\begin{equation}\r\n  WE = \\frac{P}{{100}} \\cdot SG \\cdot r\r\n   \\tag{5}\r\n\\end{equation}\\]\r\nwhere \\(r\\) is the density of water at the reference temperature for specific gravity. Any of the previous equations relating specific gravity and degrees Plato can be substituted into the above to obtain an equation for the weight of extract in solution as a function of either specific gravity or degrees Plato. Assuming degrees P = 259 - 259/SG, the weight of extract per unit volume can be written as\r\n\\[\\begin{equation}\r\n  WE = 2.59 \\cdot (SG - 1) \\cdot r\r\n   \\tag{6}\r\n\\end{equation}\\]\r\nThe density of water at 60°F (15.5°C) is 8.338 lb/gal (0.9990 kg/L) (3). Substituting the appropriate value yields the weight of extract in either pounds per gallon or kilograms per liter. Alternatively, values read from Figure 1 can be used directly in equation (5).\r\nExtract yield potential: A common measure of extract yield potential is the weight percent of raw material that will appear as extract (assumed to be sucrose) when that material is mixed or mashed with water. This value is found by dividing the weight of extract found in solution (equation (5)) by the weight of the raw material used per unit volume. The exact number can vary depending on upon how the material is used. For grains, the yield depends upon the grind (fine or coarse), the starch conversion temperature, and whether the weight of the raw material is taken “as is” or adjusted for its moisture content.\r\nBecause it is the reference, only sucrose will yield 100% of its weight as extract when dissolved in water. Other sugars, even though they will completely dissolve, produce a smaller increase in density and yield something less than 100%. Dry malt extract, for example, yields about 97%, dextrose (corn sugar) about 90%. In the case of grains, only a portion of the raw material dry weight can be dissolved, which reduces the typical yield to between 66 and 83%, depending upon the type of grain and how it is prepared. Malted barley yields at most about 80% of its dry weight in extract.\r\nAnother common measure of extract yield potential is specific gravity increase (in points) when a unit weight of raw material is mixed or mashed with water to yield a unit volume of solution. Typical units are points per pound per gallon (or points per kilogram per liter). Brewers use both extract potential by weight and specific gravity increase in points per pound per gallon in recipe formulation to determine the amount of malts and adjuncts required to reach the desired wort gravity. Laboratory analyses of malts and adjunct grains often give the extract potential by weight percent only, so it is useful to develop a conversion between the two.\r\nRelationship between extract potential by weight and specific gravity: For a unit weight of raw material, the weight of extract in a unit volume of solution (equation (6)) must be equal to the unit weight times the extract potential by weight. In English units, this gives\r\n\\[1.0 \\text{ lb (% yield)}  =  2.59 \\cdot (SG  -  1) \\cdot 8.338 \\text{ or } 46.31 \\text{ (% yield)} = \\text{points/lb/gal}\\]\r\nor in metric units,\r\n\\[1.0 \\text{ kg (% yield)}  =  2.59 \\cdot (SG  -  1) \\cdot 0.9990 \\text{ or } 386.5 \\text{ (% yield)} = \\text{points/kg/L}\\]\r\nFrom these equations it is evident that sucrose produces a specific gravity increase of 46.31 points/lb/gal (386.5 points/kg/L). Also, points per kilogram per liter = 8.346 (points/ lb/gal), since \\(\\frac{386.5}{46.31} = 8.346\\).\r\nChange in specific gravity with dilution or evaporation: As the volume of a wort is increased by dilution or decreased by evaporation, the weight of extract within it remains constant. Using the previously derived relationships, a simple expression can be found to predict the resulting specific gravity. If a volume of wort \\(V_1\\) of strength degrees \\(P_1\\) is diluted or evaporated to a new volume \\(V_2\\) and strength degrees \\(P_2\\),\r\n\\[P_2 = 100 \\cdot \\frac{\\text{weight of extract}}{\\text{weight of wort}} = 100 \\cdot \\frac{\\frac{P_1}{100} (SG_1 \\cdot \\rho \\cdot V_1)}{SG_2 \\cdot \\rho \\cdot V_2} = P_1 \\cdot \\frac{SG_1 \\cdot V_1}{SG_2 \\cdot V_2}\\]\r\nAssuming that degrees P = 259 - 259/SG, and rearranging the equation gives\r\n\\[\\begin{equation}\r\n  SG_2 - 1 = \\frac{V_1}{V_2} \\cdot (SG_1 - 1) \\text{ or } SG_{2 points} =  \\frac{V_1}{V_2} \\cdot SG_{1 points}\r\n  \\tag{7}\r\n\\end{equation}\\]\r\nEquation (7) can be used, for example, to estimate wort gravity at the end of the boil based on readings taken at the end of the lautering process. If the target gravity is not indicated, adjustments such as increasing or decreasing the boil time or adding water to the boil can be made to correct the situation. For example, suppose you collect 11.5 gal of runoff from your lauter tun at SG 1.042. You schedule a boil time of 1.5 h, over which time 1.5 gal (at 60°F) will evaporate, leaving a final volume of 10.0 gal. The predicted gravity at the end of the boil is then \\(\\frac{11.5}{10.0} \\cdot 42 = 48.3\\). One must be careful to correct the measured volume of the wort as well as its specific gravity to the reference temperature of the target specific gravity.\r\nIf the target specific gravity is 1.050 (higher than the predicted value), an increase in boil time is needed to further reduce the final volume. Solving equation (7) for the new final volume gives \\(V_2 = 11.5 \\cdot \\frac{42}{50} = 9.66\\) gal. Assuming a standard evaporation rate of 1.0 gal/h, the adjusted boil time is then \\(\\frac{(11.5-9.66)}{1.0} = 1.84\\) h.\r\nIf the target specific gravity is 1.046 (lower than the predicted value), some water can be added to the kettle, or the boil time can be reduced. In either case, the final volume is \\(V_2 = 11.5 \\cdot \\frac{42}{46} = 10.5\\) gal. If we choose to preserve the planned 1.5 h boil, evaporating 1.5 gal, the initial volume \\(V_1\\) must be adjusted to \\(10.5 + 1.5 = 12.0\\) gal. Alternatively, the boil time could be adjusted to \\(\\frac{11.5-10.5}{1.0} = 1.0\\) h. It should be noted, however, that if the boil time becomes too short, problems with hop utilization, trub formation, and elevated levels of dimethylsulfide (DMS) may result.\r\nWhenever the final volume or boil time are other than originally planned, the weight and timing of all hop additions may need to be adjusted to maintain the planned bitterness level. This is a good reason to assess the situation and make corrections at the start of the boil rather than at the end.\r\nFigures\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nClerck, J. de. 1995. A Textbook of Brewing. London: Chapman Hall.\r\n\r\n\r\nHough, J. S., D. E. Briggs, and R. Stevens. 1971. Malting and Brewing Science. Chapman and Hall.\r\n\r\n\r\nWeast, R. C. 1985. CRC Handbook of Chemistry and Physics. 66th ed. CRC Press.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-03-10-specific-gravity/sg-preview.png",
    "last_modified": "2022-01-29T13:56:52+01:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-01-17-beer-color/",
    "title": "Approximating SRM Beer Color of Homebrew Based on Recipe Formulation",
    "description": "Het originele artikel van Morey.",
    "author": [
      {
        "name": "Daniel Morey",
        "url": {}
      }
    ],
    "date": "2022-01-20",
    "categories": [
      "rekenen"
    ],
    "contents": "\r\nOne of the most challenging aspects of “brewing to style” for home brewers is trying to achieve a color within the specified range for the particular class. Home brewers have usually been left to rely on experience or trial and error to design recipes that will fit the style.\r\nColor ranges for the recognized beer styles defined by the AHA and BJCP are given in terms of SRM (Standard Reference Method). Measurement of actual SRM is not practical for the amateur brewer. Thus, Malt Color Units (MCU) have been used to quantify color often. MCU is the Lovibond rating of the ingredient multiplied by its weight in pounds divided by the beer’s volume in US gallons. The dilemma is that apparent color in terms of SRM diverges from MCU.\r\n\\[MCU = \\frac{^o L(ovibond)}{gallons}\\]\r\nMany factors impact beer color; therefore, making an exact prediction is impossible. Some factors that effect beer color are: Recipe (grains/malts), quality of crush, mash procedure (temperature(s)), mash time, mash pH, boil time, yeast, and many more. Of all the factors, the malt/grain bill has the greatest impact on color thus we can ignore the other contributors and still make a good approximation. Several individuals have studied beer color and developed models to help predict it.\r\nLINEAR MODELS\r\nThe most common method states that SRM is equivalent to MCU. This is probably the oldest approximation. The weakness of this model as documented by several authors is that color in SRM diverges from MCU for values greater than 10.\r\n\\[SRM = MCU\\]\r\nRandy Mosher developed a model based on commercial beers whose recipes and color were known. His model is expressed as:\r\n\\[SRM = (0.3*MCU) + 4.7\\]\r\nUsing this approximation, minimum beer color is 4.7. This is not realistic and the model should only be used for beer with MCU greater than 7.\r\nRay Daniels did some similar work based on homebrewed beers. Color of samples left over from home brew competitions were measured using SRM and the MCUs were calculated from the recipes submitted by the entrants. Daniels’ model differs from Mosher’s and suggests that homebrew is generally darker than commercial beers. His approximation is:\r\n\\[SRM = (0.2*MCU) + 8.4\\]\r\nLike Mosher’s model, the formula has a minimum color that is not reasonable. Consequently the formula should only be used for beers with MCU greater than 11.\r\nPOWER MODEL\r\nInspired by Ray Daniels’ three part series printed Brewing Techniques in the SEP/OCT and NOV/DEC 1995 issues, I set out to develop a single model that could apply for the complete brewing spectrum and account for the non-linear behavior observed by so many.\r\nSince I did not have raw data to work with, I based my work on five assumptions:\r\nSRM is approximately equal to MCU for values from 0 to 10.\r\nHomebrew is generally darker than commercial beer.\r\nBase on the previous qualitative postulate, I assumed that Ray Daniels’ predicted relationship exists for beers with color greater than 10.\r\nSince Mosher’s equation predicts darker color than Daniels’ model for values of MCU greater than 37, I assumed that Mosher’s approximation governed beer color for all values more than 37 MCUs.\r\nDifference in color for beers greater than 40 SRM are essentially impossible to detect visually; therefore, I limited the analysis to SRM of 50 and less.\r\nUsing these assumptions, data was created for my analysis. I tried various curve fitting techniques to find the best approximation to the assumed relationship. In the end, the power model was found best to represent the assumed curve. The resulting model was:\r\n\\[SRM = 1.49*MCU^{0.69}\\]\r\nThis model eliminates the two major limitations of linear models in my opinion. The minimum color is zero, so the model can be used for lighter color beers. The model accounts for decreased color contribution from malt as the beer gets darker or the “law of diminishing returns.”\r\nA graphical representation of my model along with Daniels’ and Mosher’s linear approximations can be found in figure 1. Also plotted is tabular data that can be found in Ray Daniels’ Designing Great Beers (Daniels 1998, pg 61) pg 61, and Greg Noonan’s New Brewing Lager Beer (Noonan 2003, pg 206).\r\n\r\n\r\n\r\nFigure 1: Color Estimates Based on Recipe MCU.\r\n\r\n\r\n\r\nSome interesting observations from the Home Brew Digest (HBD) based on work by Kyle Druey. Kyle fitted power curves to Daniels’ and Noonan’s data. These power curves along with my model all predict beer color of 40 SRM around 126 MCUs (Morey at 117 MCUs; Daniels at 136 MCUs; Noonan at 126 MCUs).\r\nThe Druey power models fitted to Daniels’ and Noonan’s data are:\r\n\\[SRM = 1.73*MCU^{0.64} - 0.27 \\text{ (Daniels)}\\]\r\n\\[SRM = 15.03*MCU^{0.27} -15.53 \\text{ (Noonan)}\\]\r\nMALT EXTRACTS\r\nPredicting color for extract recipes provides an additional challenge. Where do you find Lovibond ratings for extracts? While this information is not always available, you may use the following as approximations in the table 1 below. The data was originally printed in Ray Daniels’ article in the NOV/DEC 1995 issue of Brewing Techniques:\r\n“Color”\r\n°L\r\nExtract Type\r\nPale Golden\r\n3 - 4\r\nMunton & Fison spray-dry malt extract (light)\r\nGolden\r\n5 - 6\r\nAlexander pale extract syrup\r\nLight Amber\r\n6 - 7\r\nMunton & Fison extract syrup (pale)\r\nLight Amber\r\n6 - 7\r\nLaaglander dried malt extract\r\nAmber\r\n8 - 9\r\nJohn Bull unhopped light syrup\r\nAmber\r\n8 - 9\r\nCoopers unhopped light syrup\r\nAmber\r\n8 - 9\r\nNorthwestern gold malt extract syrup\r\nAmber\r\n8 - 9\r\nNorthwestern gold dry malt extract\r\nCONCLUSION\r\nI have been using my power model since 1996 good results. I now find that my beers are within the range I would expect for the style I’m brewing. Sure, sometimes they are slightly darker or lighter than I envisioned but the days of gross color errors are gone.\r\nAs previously stated, exact color predictions are not possible. Due to the many factors ignored by these simplified models, we should treat all color predictions as approximations. Actual color deviations of 20% or more from the prediction can be expected.\r\nWhat method is best for you? That is for you to decide. I suggest you try the models and find the one that gives results you expect for the style you are brewing. With these simple tools, you can tailor your recipes to achieve color within the desired range.\r\n\r\n\r\n\r\nDaniels, Ray. 1998. Designing Great Beers: The Ultimate Guide to Brewing Classic Beer Styles. Boulder, CO: Brewers Publications.\r\n\r\n\r\nNoonan, Gregory J. 2003. New Brewing Lager Beer: The Most Comprehensive Book for Home and Microbrewers. Revised, Expanded edition. Boulder, Colo.: Brewers Publications.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-17-beer-color/distill-preview.png",
    "last_modified": "2022-01-29T13:56:52+01:00",
    "input_file": {},
    "preview_width": 574,
    "preview_height": 431
  },
  {
    "path": "posts/2020-08-04-hoprendement-kooktijd/",
    "title": "Hoprendement - Kooktijd",
    "description": "Relatie tussen de hopbitterheid en de kooktijd.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-08-04",
    "categories": [
      "rekenen",
      "hop"
    ],
    "contents": "\r\nIn het artikel What’s your IBU van Michael Hall (1997) is een tabel gepubliceerd met daarin het hoprendement als functie van de kooktijd. Deze waarden zijn te zien in tabel 1.\r\n\r\n\r\n\r\nTable 1: Rendement als functie van de kooktijd (min.)\r\n\r\n\r\nBoiltime\r\n\r\n\r\nRAGER\r\n\r\n\r\nGARETZ\r\n\r\n\r\nMOSHER\r\n\r\n\r\nTINSETH\r\n\r\n\r\nNOONAN\r\n\r\n\r\nDANIELS\r\n\r\n\r\n0.0\r\n\r\n\r\n5.0\r\n\r\n\r\n0\r\n\r\n\r\n0.0\r\n\r\n\r\n0.000\r\n\r\n\r\n5.0\r\n\r\n\r\n5\r\n\r\n\r\n2.5\r\n\r\n\r\n5.0\r\n\r\n\r\n0\r\n\r\n\r\n1.8\r\n\r\n\r\n2.414\r\n\r\n\r\n5.0\r\n\r\n\r\n5\r\n\r\n\r\n5.0\r\n\r\n\r\n5.0\r\n\r\n\r\n0\r\n\r\n\r\n3.5\r\n\r\n\r\n4.598\r\n\r\n\r\n5.0\r\n\r\n\r\n5\r\n\r\n\r\n7.5\r\n\r\n\r\n6.0\r\n\r\n\r\n0\r\n\r\n\r\n4.8\r\n\r\n\r\n6.575\r\n\r\n\r\n5.8\r\n\r\n\r\n5\r\n\r\n\r\n10.0\r\n\r\n\r\n6.0\r\n\r\n\r\n0\r\n\r\n\r\n6.1\r\n\r\n\r\n8.363\r\n\r\n\r\n6.5\r\n\r\n\r\n12\r\n\r\n\r\n12.5\r\n\r\n\r\n8.0\r\n\r\n\r\n2\r\n\r\n\r\n7.4\r\n\r\n\r\n9.981\r\n\r\n\r\n7.2\r\n\r\n\r\n12\r\n\r\n\r\n15.0\r\n\r\n\r\n8.0\r\n\r\n\r\n2\r\n\r\n\r\n8.7\r\n\r\n\r\n11.446\r\n\r\n\r\n8.0\r\n\r\n\r\n12\r\n\r\n\r\n17.5\r\n\r\n\r\n10.1\r\n\r\n\r\n5\r\n\r\n\r\n9.3\r\n\r\n\r\n12.770\r\n\r\n\r\n9.2\r\n\r\n\r\n12\r\n\r\n\r\n20.0\r\n\r\n\r\n10.1\r\n\r\n\r\n5\r\n\r\n\r\n9.9\r\n\r\n\r\n13.969\r\n\r\n\r\n10.3\r\n\r\n\r\n15\r\n\r\n\r\n22.5\r\n\r\n\r\n12.1\r\n\r\n\r\n8\r\n\r\n\r\n10.6\r\n\r\n\r\n15.054\r\n\r\n\r\n11.5\r\n\r\n\r\n15\r\n\r\n\r\n25.0\r\n\r\n\r\n12.1\r\n\r\n\r\n8\r\n\r\n\r\n11.2\r\n\r\n\r\n16.035\r\n\r\n\r\n12.7\r\n\r\n\r\n15\r\n\r\n\r\n27.5\r\n\r\n\r\n15.3\r\n\r\n\r\n11\r\n\r\n\r\n11.8\r\n\r\n\r\n16.924\r\n\r\n\r\n13.8\r\n\r\n\r\n15\r\n\r\n\r\n30.0\r\n\r\n\r\n15.3\r\n\r\n\r\n11\r\n\r\n\r\n12.4\r\n\r\n\r\n17.727\r\n\r\n\r\n15.0\r\n\r\n\r\n19\r\n\r\n\r\n32.5\r\n\r\n\r\n18.8\r\n\r\n\r\n14\r\n\r\n\r\n12.9\r\n\r\n\r\n18.454\r\n\r\n\r\n16.1\r\n\r\n\r\n19\r\n\r\n\r\n35.0\r\n\r\n\r\n18.8\r\n\r\n\r\n14\r\n\r\n\r\n13.4\r\n\r\n\r\n19.112\r\n\r\n\r\n17.2\r\n\r\n\r\n19\r\n\r\n\r\n37.5\r\n\r\n\r\n22.8\r\n\r\n\r\n16\r\n\r\n\r\n13.9\r\n\r\n\r\n19.707\r\n\r\n\r\n18.2\r\n\r\n\r\n19\r\n\r\n\r\n40.0\r\n\r\n\r\n22.8\r\n\r\n\r\n16\r\n\r\n\r\n14.3\r\n\r\n\r\n20.246\r\n\r\n\r\n19.3\r\n\r\n\r\n19\r\n\r\n\r\n42.5\r\n\r\n\r\n26.9\r\n\r\n\r\n18\r\n\r\n\r\n14.8\r\n\r\n\r\n20.733\r\n\r\n\r\n20.4\r\n\r\n\r\n19\r\n\r\n\r\n45.0\r\n\r\n\r\n26.9\r\n\r\n\r\n18\r\n\r\n\r\n15.3\r\n\r\n\r\n21.174\r\n\r\n\r\n21.5\r\n\r\n\r\n22\r\n\r\n\r\n47.5\r\n\r\n\r\n28.1\r\n\r\n\r\n19\r\n\r\n\r\n15.6\r\n\r\n\r\n21.574\r\n\r\n\r\n22.6\r\n\r\n\r\n22\r\n\r\n\r\n50.0\r\n\r\n\r\n28.1\r\n\r\n\r\n19\r\n\r\n\r\n15.9\r\n\r\n\r\n21.935\r\n\r\n\r\n23.7\r\n\r\n\r\n22\r\n\r\n\r\n52.5\r\n\r\n\r\n30.0\r\n\r\n\r\n20\r\n\r\n\r\n16.2\r\n\r\n\r\n22.261\r\n\r\n\r\n24.8\r\n\r\n\r\n22\r\n\r\n\r\n55.0\r\n\r\n\r\n30.0\r\n\r\n\r\n20\r\n\r\n\r\n16.6\r\n\r\n\r\n22.557\r\n\r\n\r\n25.8\r\n\r\n\r\n22\r\n\r\n\r\n57.5\r\n\r\n\r\n30.0\r\n\r\n\r\n20\r\n\r\n\r\n16.9\r\n\r\n\r\n22.824\r\n\r\n\r\n26.9\r\n\r\n\r\n22\r\n\r\n\r\n60.0\r\n\r\n\r\n30.0\r\n\r\n\r\n20\r\n\r\n\r\n17.2\r\n\r\n\r\n23.066\r\n\r\n\r\n28.0\r\n\r\n\r\n24\r\n\r\n\r\n62.5\r\n\r\n\r\n30.0\r\n\r\n\r\n21\r\n\r\n\r\n17.5\r\n\r\n\r\n23.285\r\n\r\n\r\n28.2\r\n\r\n\r\n24\r\n\r\n\r\n65.0\r\n\r\n\r\n30.0\r\n\r\n\r\n21\r\n\r\n\r\n17.8\r\n\r\n\r\n23.484\r\n\r\n\r\n28.5\r\n\r\n\r\n24\r\n\r\n\r\n67.5\r\n\r\n\r\n30.0\r\n\r\n\r\n21\r\n\r\n\r\n18.1\r\n\r\n\r\n23.663\r\n\r\n\r\n28.8\r\n\r\n\r\n24\r\n\r\n\r\n70.0\r\n\r\n\r\n30.0\r\n\r\n\r\n21\r\n\r\n\r\n18.4\r\n\r\n\r\n23.825\r\n\r\n\r\n29.0\r\n\r\n\r\n24\r\n\r\n\r\n72.5\r\n\r\n\r\n30.0\r\n\r\n\r\n22\r\n\r\n\r\n18.7\r\n\r\n\r\n23.972\r\n\r\n\r\n29.2\r\n\r\n\r\n24\r\n\r\n\r\n75.0\r\n\r\n\r\n30.0\r\n\r\n\r\n22\r\n\r\n\r\n19.0\r\n\r\n\r\n24.105\r\n\r\n\r\n29.5\r\n\r\n\r\n27\r\n\r\n\r\n77.5\r\n\r\n\r\n30.0\r\n\r\n\r\n22\r\n\r\n\r\n19.3\r\n\r\n\r\n24.225\r\n\r\n\r\n29.8\r\n\r\n\r\n27\r\n\r\n\r\n80.0\r\n\r\n\r\n30.0\r\n\r\n\r\n22\r\n\r\n\r\n19.6\r\n\r\n\r\n24.334\r\n\r\n\r\n30.0\r\n\r\n\r\n27\r\n\r\n\r\n82.5\r\n\r\n\r\n30.0\r\n\r\n\r\n23\r\n\r\n\r\n19.9\r\n\r\n\r\n24.432\r\n\r\n\r\n30.2\r\n\r\n\r\n27\r\n\r\n\r\n85.0\r\n\r\n\r\n30.0\r\n\r\n\r\n23\r\n\r\n\r\n20.2\r\n\r\n\r\n24.521\r\n\r\n\r\n30.5\r\n\r\n\r\n27\r\n\r\n\r\n87.5\r\n\r\n\r\n30.0\r\n\r\n\r\n23\r\n\r\n\r\n20.5\r\n\r\n\r\n24.602\r\n\r\n\r\n30.8\r\n\r\n\r\n27\r\n\r\n\r\n90.0\r\n\r\n\r\n30.0\r\n\r\n\r\n23\r\n\r\n\r\n20.8\r\n\r\n\r\n24.675\r\n\r\n\r\n31.0\r\n\r\n\r\n27\r\n\r\n\r\n\r\nIn figuur 1 zie je het hoprendement als van functie van de kooktijd voor een wort met SG 1,050, met verse hopbloemen, geen hopzak, geen filtering en een gist met gemiddelde uitvlokking.\r\n\r\n\r\n\r\nFigure 1: Hoprendement als functie van de kooktijd\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-08-04-hoprendement-kooktijd/distill-preview.png",
    "last_modified": "2022-01-29T13:56:52+01:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2020-06-04-hopbitterheid/",
    "title": "Hopbitterheid en EBU (IBU)",
    "description": "Manieren om de bitterheid van hoptoevoegingen in bier te bepalen.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-06-04",
    "categories": [
      "rekenen",
      "hop"
    ],
    "contents": "\r\n\r\nContents\r\nInleiding\r\nMeeteenheden voor de bitterheid\r\nAAU en HBU\r\nVoorbeeld 1\r\nVoorbeeld 2\r\n\r\nIBU en EBU\r\nVoorbeeld 3\r\nVoorbeeld 4\r\n\r\n\r\nDecimaal Hoprendement\r\nEenvoudige methode\r\nKooktijdafhankelijke methodes\r\nRager\r\nTinseth\r\nGaretz\r\nDaniels\r\n\r\n\r\nSamenvatting\r\nVoorbeelden\r\n\r\nInleiding\r\nEen van de belangrijkste bijdrage van hop aan bier is de bitterheid. Bitterheid biedt een tegenhanger aan de zoetheid van de mout om zo een uitgebalanceerd bier te maken. In dit artikel wordt beschreven waar de bitterheid van bier vandaan komt en hoe je deze kent berekenen. De inhoud is voor een belangrijk deel gebaseerd op het werk van Michael Hall (Hall 1997), alsmede ook bijdragen afkomstig uit de Hop FAQ van Norm Pyle (Pyle 1995).\r\nDe bitterheid van de hop komt door de harsen in de hop. Deze harsen en ook de vluchtige hopoliën zitten in het gele hopmeel. Deze harsen, kristallijne zwakke zuren, worden gecategoriseerd als alfa-, beta- en gammafracties. De alfa- en betafracties worden ook wel weekharsen genoemd omdat ze oplosbaar zijn in hexaan. De gammmafractie is niet oplosbaar in hexaan en wordt daarom ook wel harde hars genoemd. Deze draagt niet bij aan de bitterheid van bier.\r\nDe alfafractie bestaat uit een aantal aan elkaar gerelateerde stoffen (humulone, cohumulone, adhumulone, prehumulone en posthumulone) die als groep alfazuren worden genoemd. De hoeveelheid alfazuur is per hopsoort verschillend en bedraagt zo’n 2-15% van het hopgewicht. De oplosbaarheid van deze alfazuren in wort van 100oC en een pH van 5 bedraagt 250 mg/lit. In bier met zijn lagere pH en lagere temperatuur zijn ze niet erg oplosbaar en zullen neerslaan. Tijdens het koken ondergaan de alfazuren een moleculaire verandering, isomerisatie genoemd. De ontstane stoffen worden isoalfazuren genoemd, welke beter oplosbaar zijn in wort en bier en de voornaamste bron van de bitterheid van het bier vormen.\r\nDe betafractie van de harsen bestaat uit betazuren en veel andere stoffen, waaronder oxidatieprodukten van de alfa- en betazuren die ontstaan door de veroudering van de hop. De betazuren bestaan uit verschillende lupulonen, vergelijkbaar met de humulonen. De betazuren zijn minder oplosbaar dan de alfazuren, maar ze leveren een kleine bijdrage aan de bitterheid van het bier door hun oxidatieprodukten.\r\nDoor allerlei oorzaken komen niet alle (iso)alfazuren in het uiteindelijke bier terecht. Mogelijke factoren die een rol spelen zijn:\r\nkooktijd van de hop\r\nde intensiteit van het koken\r\nde temperatuur tijdens het koken\r\nde dichtheid van de wort tijdens het koken\r\nde pH van de wort tijdens het koken\r\nde concentratie van de hop (gram per liter) in de wort\r\nde gebruikte hopvorm (bloemen, plugs, pellets, extract)\r\nhet al dan niet gebruiken van een hopzak\r\nde hoeveelheid eiwituitvlokking tijdens het koken\r\nde absorptie van bitterstoffen door de gist\r\nhet verwijderen van de hopharsen\r\nde grootte en vorm van het kookvat\r\nhet gebruik van eventuele klaringsmiddelen tijdens koken en lageren\r\nhet eventueel filteren van het bier\r\nUiteindelijk komt slechts zo’n 10%-40% van de toegevoegde alfazuren in het bier terecht. De fractie die in het bier terecht komt wordt decimaal hoprendement (DHR) genoemd. Voor een schatting van de bitterheid van het bier is dit DHR van groot belang.\r\nMeeteenheden voor de bitterheid\r\nAAU en HBU\r\nIn 1985 is door Dave Line (Line 1985) de AAU (Alpha Acid Unit) ontwikkeld en in 1991 door Charlie Papazian (Papazian 1994) overgenomen onder de naam HBU (Hop Bittering Unit). Beide eenheden zijn hetzelfde en berekenen de massa van de toegevoegde alfazuren.\r\n\\[AAU = HBU = W_{oz} \\cdot A_{\\%}\\]\r\n\\(W_{oz}\\) is het hopgewicht, uitgedrukt in ounces.\r\n\\(A_{\\%}\\) is het gehalte alfazuur in de hop, uitgedrukt als percentage.\r\n\r\n1 ounce = 28,35 gram\r\nVoorbeeld 1\r\nWordt in een recept 2,5 ounces Saaz 3% alfazuur gebruikt, dan is de hoeveelheid alfazuur 2,5x3 = 7,5 ounce. Dus AAU = HBU = 7,5.\r\nDe AAU en HBU houden geen rekening met het hoprendement en zijn voor de berekening van de bitterheid van het bier niet bruikbaar.\r\nDe berekening van de hoeveelheid alfazuur is wel nuttig wanneer het alfazuurpercentage van de hop in een recept niet overeenkomt met het alfazuurpercentage van de beschikbare hop. Wanneer je toch evenveel alfazuur wilt toevoegen, dan moet je de hoeveelheid hop aanpassen.\r\nVoorbeeld 2\r\nIn een recept staat dat je 52 gram Cascade hop 5,8% alfa moet toevoegen en je beschikt over Cascade hop van 7,5% alfa. Hoeveel van deze hop moet je dan toevoegen?\r\nHoeveelheid cascade hop 7,5% alfa : \\(\\frac{52 \\times 5,8}{7,5} = 40\\) gram\r\nIBU en EBU\r\nEen betere maat om de bitterheid te berekenen is de EBU (European Bitter Unit) en de in Amerika gebruikte IBU (International Bitter Unit). Ze zijn in feite hetzelfde, maar verschillen in de analysemethode waardoor er toch kleine verschillen kunnen zijn.\r\n\\[\\text{1 EBU = 1 IBU = 1 mg iso-alfazuur per liter bier = 1 ppm iso-alfazuur}\\]\r\nIn tabel 1 is te zien hoe deze waarden ervaren worden.\r\n\r\n\r\nTable 1: Ervaringen\r\n\r\n\r\nBitterheid\r\n\r\n\r\nEBU\r\n\r\n\r\nWeinig bitter\r\n\r\n\r\n5-20\r\n\r\n\r\nBitterig\r\n\r\n\r\n20-30\r\n\r\n\r\nBitter\r\n\r\n\r\n30-40\r\n\r\n\r\nZeer Bitter\r\n\r\n\r\n> 40\r\n\r\n\r\nIn de ideale situatie waarin alle alfazuren omgezet worden in isoalfazuren, dus bij een hoprendement van 100% is de formule voor de berekening van de EBU.\r\n\\[EBU_{ideaal} = 1000 \\frac{W \\cdot A}{V} \\text{ mg/lit}\\].\r\n\\(W\\) = hoeveelheid toegevoegde hop (gram)\r\n\\(A\\) = fractie alfazuur (als decimaal getal, geen percentage!)\r\n\\(V\\) = volume van het uiteindelijke bier (liter)\r\n\r\nDe factor 1000 is voor de omrekening van gram naar mg.\r\nVoorbeeld 3\r\nEen toevoeging van 15 gram Hallertauer 4% alfa aan 25 liter wort geeft\r\n\\(EBU_{ideaal} = 1000 \\frac{15 \\times 0,04}{25} = 24\\)\r\nDe werkelijkheid is complexer, immers niet alle alfazuren komen in het bier. Om dit in rekening te brengen wordt de ideale uitkomst met een getal vermenigvuldigd dat alle processen in rekening brengt die er voor zorgen dat de hoeveelheid isoalfazuren in het bier minder is dan de toegevoegd hoeveelheid alfazuren. Dit getal is het eerder genoemde decimaal hoprendement (DHR). De formule wordt dan:\r\n\\[EBU = EBU_{ideaal} \\cdot DHR\\]\r\n\\(DHR\\) = Decimaal Hoprendement (fractie, geen percentage)\r\nVoorbeeld 4\r\nZou in het geval van voorbeeld 3 het hoprendement 25% bedragen, dan is DHR = 0,25 en EBU = 24 x 0,25 = 6\r\nDeze eenvoudige recht toe recht aan formule wordt door alle software programma’s gebruikt om de EBU in het bier te schatten. Het probleem is echter het bepalen van het hoprendement. Daarin verschillen de programma’s en tabellen die je tegenkomt.\r\nDecimaal Hoprendement\r\nEenvoudige methode\r\nGebruik tabel 2 voor een eenvoudige schatting van het digitaal hoprendement (DHR).\r\n\r\n\r\nTable 2: DHR schatting\r\n\r\n\r\nHopsoort\r\n\r\n\r\nKooktijd (min)\r\n\r\n\r\nDHR\r\n\r\n\r\nBitterhop\r\n\r\n\r\n>= 60\r\n\r\n\r\n0,25\r\n\r\n\r\nSmaakhop\r\n\r\n\r\n10-30\r\n\r\n\r\n0,10\r\n\r\n\r\nAromahop\r\n\r\n\r\n< 10\r\n\r\n\r\n0\r\n\r\n\r\nDryhop\r\n\r\n\r\n\r\n\r\n0\r\n\r\n\r\nKooktijdafhankelijke methodes\r\nVrijwel alle programma’s en methodes om de EBU/IBU te schatten houden rekening met de duur van de kooktijd en de dichtheid van de kookvloeistof. De hier besproken methodes zijn:\r\nRager (Rager 1990), een nauwkeurige en eenvoudige methode met correcties voor kooktijden en wortdichtheid.\r\nGaretz (Garetz 1994), relatief ingewikkelde methode met correcties voor kooktijden, wortdichtheid, hopvorm, hopconcentratie, hopzakjes, filtering, hop veroudering en gist uitvlokking.\r\nTinseth (Tinseth 1997), methode (formules) met correcties voor kooktijd en wortdichtheid.\r\nDaniels (Daniels 1998), methode met correcties voor kooktijd en wortdichtheid.\r\nDaarnaast zijn er ook nog de methodes van Mosher (Mosher 1994) en Noonan (Noonan 2003).\r\nDe vele software programma’s bieden één of meerdere van deze methodes aan. Vaak is Tinseth de standaardkeuze.\r\n\r\n\r\nTable 3: EBU methode\r\n\r\n\r\nBrouwprogramma\r\n\r\n\r\nDaniels\r\n\r\n\r\nGaretz\r\n\r\n\r\nRager\r\n\r\n\r\nTinseth\r\n\r\n\r\nBrouwhulp\r\n\r\n\r\nx\r\n\r\n\r\nx\r\n\r\n\r\nx\r\n\r\n\r\nx\r\n\r\n\r\nBrouwvisie\r\n\r\n\r\nx\r\n\r\n\r\nx\r\n\r\n\r\nx\r\n\r\n\r\nx\r\n\r\n\r\nBrOdeLuxe\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nx\r\n\r\n\r\nAlle methodes geven een hoprendementsfactor op basis van de kooktijd (\\(DHR_{kooktijd}\\)), soms via tabellen en soms via formules. Daarnaast zijn er meer factoren die van invloed kunnen zijn op het hoprendement. Het overall decimaal hoprendement \\(DHR\\) is dan het product van \\(DHR_{kooktijd}\\) en een aantal correctiefactoren.\r\n\\[DHR = DHR_{kooktijd} \\cdot C_{sg} \\cdot C_{hv} \\cdot C_{hc} \\cdot C_{kpt} \\cdot C_{opslag} \\cdot C_{hz} \\cdot C_{gv} \\cdot C_{fil}\\]\r\n\r\n\r\nTable 4: Factoren voor correctie\r\n\r\n\r\nC factor\r\n\r\n\r\noorzaak\r\n\r\n\r\ntoelichting\r\n\r\n\r\nC_sg\r\n\r\n\r\nSG kookvloeistof\r\n\r\n\r\nIn het algemeen neemt het hoprendement af bij toenemende dichtheid van de kookvloeistof.\r\n\r\n\r\nC_hv\r\n\r\n\r\nhopvorm\r\n\r\n\r\nHopbloemen en plugs hebben geen correctie nodig, maar hoppellets wel want deze hebben een hoger rendement dan de andere twee vormen.\r\n\r\n\r\nC_hc\r\n\r\n\r\nhopconcentratie\r\n\r\n\r\nRendement neemt af wanneer meer hop wordt toegevoegd. Alleen Garetz heeft hiervoor een formule ontwikkeld.\r\n\r\n\r\nC_kpt\r\n\r\n\r\nkooktemperatuur\r\n\r\n\r\nDe kooktemperatuur hangt af van de locatie op aarde. Alleen Garetz heeft hiervoor een correctiefactor.\r\n\r\n\r\nC_opslag\r\n\r\n\r\nopslag\r\n\r\n\r\nDe alfazuren gaan achteruit wanneer ze ouder worden. Het is niet echt duidelijk of de oxidatieprodukten van de betazuren dit enigszins compenseren en of er al dan niet een correctie nodig is. Alleen Garetz heeft hiervoor een formule ontwikkeld.\r\n\r\n\r\nC_hz\r\n\r\n\r\nhopzakjes\r\n\r\n\r\nMoeilijk te aan te geven. Alleen Garetz doet een poging hiertoe.\r\n\r\n\r\nC_gv\r\n\r\n\r\ngistuitvlokking\r\n\r\n\r\nMoeilijk te aan te geven. Alleen Garetz doet een poging hiertoe.\r\n\r\n\r\nC_fill\r\n\r\n\r\nfiltering\r\n\r\n\r\nMoeilijk te aan te geven. Alleen Garetz doet een poging hiertoe.\r\n\r\n\r\nEen correctiefactor voor de dichtheid van de kookvloeistof \\(C_{sg}\\) geven alle methodes. Indien mogelijk neem dan voor de dichtheid van de vloeistof de gemiddelde waarde tijdens het hele kookproces (\\(SG_{koken}\\) ) om rekening te houden met het kleiner worden van het kookvolume.\r\nWanneer je geen correctie voor een bepaald onderdeel wilt gebruik je de waarde 1 voor de correctiefactor.\r\nDe methodes van Rager en Tinseth worden hierna uitgewerkt, die van Garetz en Daniels gedeeltelijk en die van Mosher en Noonan niet.\r\nRager\r\nHet hoprendement op basis van de kooktijd wordt via een tabel gegeven.\r\nkooktijd (min.)\r\n\\(DHR_{kooktijd}\\)\r\n0 - 5\r\n0,050\r\n6 - 10\r\n0,060\r\n11 - 15\r\n0,080\r\n16 - 20\r\n0,101\r\n21 - 25\r\n0,121\r\n26 - 30\r\n0,153\r\n31 - 35\r\n0,188\r\n36 - 40\r\n0,228\r\n41 - 45\r\n0,269\r\n46 - 50\r\n0,281\r\n51 - 60\r\n0,300\r\n60 - 90\r\n0,300\r\nRager gaat er vanuit dat het hoprendement afneemt bij toenemende dichtheid boven de 1,050 van de kookvloeistof.\r\n\\(SG_{koken} \\leq 1,050\\) dan \\(C_{sg} = 1\\)\r\n\\(SG_{koken} \\gt 1,050\\) dan \\(C_{sg} = \\frac{1}{1 + 5\\times (SG_{koken} - 1,050)}\\)\r\nAndere correctiefactoren gebruikt Rager niet. Dus \\(DHR = DHR_{kooktijd} \\times C_{sg}\\)\r\nHelaas geeft Rager geen toelichting gegeven op basis waarvan de waarden tot stand zijn gekomen. En zijn rendementen worden veelal als optimistisch ervaren. Zelfs bij een kooktijd van 0 minuten wordt van een rendement van 5% uitgegaan. De methode van Rager schijnt bij hoppellets beter te werken dan bij hopbloemen.\r\nTinseth\r\nDe methode van Tinseth wordt het meest gebruikt en werkt met formules. De uitkomst is vaak iets lager dan bij Rager, maar niet altijd. Tinseth beveelt verder aan om met name de formule voor kooktijd aan te passen aan de eigen situatie, door te experimenteren met de factor 4,15.\r\n\\(DHR_{kooktijd} = \\frac{1 - e^{-0,04 \\times kooktijd(min.)}}{4,15}\\)\r\n\\(C_{sg} = 1,65 \\times 0,000125^{SG_{koken} - 1}\\)\r\nAndere correctiefactoren gebruikt Tinseth niet. Dus \\(DHR = DHR_{kooktijd} \\times C_{sg}\\)\r\nGaretz\r\nDeze methode is een iteratieve methode en daardoor lastiger te gebruiken. Het is de enige methode die met veel correctiefactoren werkt. Het hoprendement op basis van de kooktijd wordt via een tabel gegeven.\r\nkooktijd (min.)\r\n\\(DHR_{kooktijd}\\)\r\n0 - 5\r\n0,00\r\n6 - 10\r\n0,00\r\n11 - 15\r\n0,02\r\n16 - 20\r\n0,05\r\n21 - 25\r\n0,08\r\n26 - 30\r\n0,11\r\n31 - 35\r\n0,14\r\n36 - 40\r\n0,16\r\n41 - 45\r\n0,18\r\n46 - 50\r\n0,19\r\n51 - 60\r\n0,20\r\n61 - 70\r\n0,21\r\n71 - 80\r\n0,22\r\n81 - 90\r\n0,23\r\nVoor de SG correctie wordt de formule van Rager gebruikt.\r\nHopvorm correctiefactor = 1,1 voor kooktijden van de pellets van 1-30 min. en anders 1.\r\nVoor de andere correctiefactoren zie zijn boek.\r\nDaniels\r\nHet hoprendement op basis van de kooktijd wordt voor hopbloemen en hoppellets via een tabel gegeven. Er hoeft dus geen correctiefactor voor de hopvorm gegeven te worden. Zou je daar toch mee willen werken dan valt uit de tabel valt op te maken dat deze ongeveer 1,26 is.\r\nkooktijd (min.)\r\nDHR bloemen\r\nDHR pellets\r\n0 - 9\r\n0,05\r\n0,06\r\n10 - 19\r\n0,12\r\n0,15\r\n20 - 29\r\n0,15\r\n0,19\r\n30 - 44\r\n0,19\r\n0,24\r\n45 - 59\r\n0,22\r\n0,27\r\n60 - 74\r\n0,24\r\n0,30\r\n70 - …\r\n0,27\r\n0,34\r\nVoor de SG correctie wordt de formule van Rager gebruikt.\r\nSamenvatting\r\nAlle methodes geven een schatting van de EBU waarde. De exacte waarde kan alleen via een laboratorium test bepaald worden. Uit onderzoeken blijkt ook nog eens dat de meeste mensen slechts een verschil van 4 of groter kunnen waarnemen. Hoe belangrijk is het dan nog om een zo goed mogelijke schatting te maken?\r\nDe adviezen die gegeven worden komen er op neer om een zo constant mogelijk en reproduceerbaar brouwproces uit te voeren. De eigen brouwinstallatie zo goed mogelijk te leren kennen. En dan na het brouwen van een bier de berekende EBU waarde te vergelijken met een laboratoriumuitkomst (wanneer dat kan) of via proeven te vergelijken met een bier waarvan de EBU waarde bekend is. Op basis van de eventuele verschillen kun je dan een correctiefactor voor jouw brouwproces maken. Verder is het opmerkelijk dat de eenvoudige methode verrassend goede schattingen geeft.\r\nVoorbeelden\r\nBerekening van de EBU volgens de methode eenvoudig, Tinseth, Rager en Daniels voor een aantal brouwsels.\r\nBrouwsel 1\r\nEr wordt 20 liter Kölsch gebrouwen met een begin SG van 1,045 en de volgende hopgiften:\r\n24 gram Hallertau 6,6% alpha, bloemen, kooktijd 60 min.\r\n32 gram Saaz 2,9% alpha, bloemen, kooktijd 15 min.\r\nBrouwsel 2\r\nEr wordt 80 liter Dubbel gebrouwen met een begin SG van 1,065 en de volgende hopgiften:\r\n100 gram Hallertau 6,5%, bloemen, kooktijd 80 min.\r\n50 gram Hallertau 6,5%, bloemen, kooktijd 15 min.\r\n100 gram Tettnanger 3,8%, bloemen, kooktijd 15 min.\r\nBrouwsel 3\r\nEr wordt 30 liter Pale Ale gebrouwen met een begin SG van 1,060 en de volgende hopgiften:\r\n50 gram Cascade 5,2% alpha, pellets, kooktijd 60 min.\r\n20 gram Cascade 5,2% alpha, pellets, kooktijd 10 min.\r\n\r\n\r\n\r\nDaniels, Ray. 1998. Designing Great Beers: The Ultimate Guide to Brewing Classic Beer Styles. Boulder, CO: Brewers Publications.\r\n\r\n\r\nGaretz, Mark S. 1994. Using Hops: The Complete Guide to Hops for the Craftbrewer. Danville, CA: Hoptech.\r\n\r\n\r\nHall, Michael L. 1997. “Calculating Bitterness.” Zymurgy Special, 54–67. https://www.homebrewersassociation.org/attachments/0000/2501/IBUs.pdf.\r\n\r\n\r\nLine, Dave. 1985. The Big Book of Brewing. Later Edition edition. Andover: G. W. Kent.\r\n\r\n\r\nMosher, Randy. 1994. The Brewer’s Companion. Alephenalia Press.\r\n\r\n\r\nNoonan, Gregory J. 2003. New Brewing Lager Beer: The Most Comprehensive Book for Home and Microbrewers. Revised, Expanded edition. Boulder, Colo.: Brewers Publications.\r\n\r\n\r\nPapazian, Charlie. 1994. The Complete Joy of Homebrewing. New York: Avon Books.\r\n\r\n\r\nPyle, Norm. 1995. “Norm Pyle’s Hops FAQ.” http://realbeer.com/hops/FAQ.html.\r\n\r\n\r\nRager, Jackie. 1990. “Calculating Hop Bitterness in Beer.” Zymurgy Special 13: 53–54.\r\n\r\n\r\nTinseth, Glenn. 1997. “Glenn’s Hop Utilization Page.” http://www.realbeer.com/hops/research.html.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-06-04-hopbitterheid/hop.png",
    "last_modified": "2022-01-29T13:56:52+01:00",
    "input_file": {},
    "preview_width": 176,
    "preview_height": 142
  },
  {
    "path": "posts/2020-01-12-alfazuurwaarden/",
    "title": "Alfazuurwaarden hopoogst 2010-2019",
    "description": "Alfazuurwaarden van hopoogst 2010-2019.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2020-01-12",
    "categories": [
      "hop"
    ],
    "contents": "\r\nIn november heeft Brauwelt op haar website een artikel over de alfazuurwaarden van de hopoogst in 2019 geplaatst, aangevuld met de waarden voor de voorgaande 10 jaren (voor zover bekend). Het betreft hier hopsoorten uit de Duitse teeltregio’s Hallertau, Spalt en Tettnang, aangevuld met Tsjechië, Slovenië en Polen. Waarom de regio Hersbruck niet is opgenomen is mij onbekend. Ik heb de gepubliceerde gegevens in een .csv bestand verzameld en de labels en namen van landen indien nodig vertaald.\r\nVia alfazuur_hop_20102019.csv kun je het gegevensbestand downloaden en in Excel inlezen. Maar beter is het om dat via Power Query te doen. Voor het resultaat zie figuur 1. In de kolom Type staat A* voor aromahoppen en B** voor bitterhoppen.\r\n\r\n\r\n\r\nFigure 1: Luchtdroge alfazuurwaarden volgens EBC 7.4 in vers geoogste hop van de oogsten 2010-2019.\r\n\r\n\r\n\r\nHierna kun je zelf gemiddelde waarden uitrekenen en proberen trends te ontdekken.\r\n\r\n\r\n\r\n",
    "preview": "posts/2020-01-12-alfazuurwaarden/alfazuur_hop_20102019.png",
    "last_modified": "2022-01-29T13:56:52+01:00",
    "input_file": {},
    "preview_width": 600,
    "preview_height": 496
  },
  {
    "path": "posts/2019-11-18-bjcp-biertypenlijst/",
    "title": "BJCP Biertypenlijst",
    "description": "De Amerikaanse BJCP biertypenlijst in een Excel bestand.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2019-11-18",
    "categories": [
      "excel",
      "biertype"
    ],
    "contents": "\r\nUpdate januari 2022\r\nDe laatste versie van de BJCPbiertypenlijst is van december 2021. De wijzigingen zijn doorgevoerd in het hieronder vermelde csv bestand. De speciale bieren waarvoor geen technische kenmerken beschikbaar zijn (vanaf categorie 28) zijn hierin niet opgenomen.\r\nDe Amerikaanse BJCP (Beer Judge Certification Program) gebruikt bij haar keuringen een uitgebreide lijst met biertypen, de zogenaamde BJCP Style Guidelines. De laatste versie kun je downloaden via BJCP Style Guidelines.\r\nEvenals voor de lijst van het Bier Keurmeesters Gilde (BKG) heb ik ook voor deze BJCP lijst de technische kenmerken van de biertypen in een gestructureerd csv bestand geplaatst welke je weer in verschillende applicaties, waaronder Excel, kunt inladen. De gebruikte variabelen zijn:\r\nvariabele\r\ngegevenstype\r\ntoelichting\r\nCategoryNo\r\ngeheel getal\r\nCategorie nummer\r\nCategoryName\r\ntekst\r\nCategorie\r\nStyle_id\r\ntekst\r\nBJCP stijl nummer\r\nBeerStyle\r\ntekst\r\nBier stijl\r\nOGmin\r\ndecimaal getal\r\nBegin SG, minimum\r\nOGmax\r\ndecimaal getal\r\nBegin SG, maximum\r\nFGmin\r\ndecimaal getal\r\nEind SG, minimum\r\nFGmax\r\ndecimaal getal\r\nEind SG, maximum\r\nABVmin\r\ndecimaal getal\r\nAlcohol volumepercentage, minimum\r\nABVmax\r\ndecimaal getal\r\nAlcohol volumepercentage, maximum\r\nIBUmin\r\ngeheel getal\r\nBitterheid, minimum (IBU)\r\nIBUmax\r\ngeheel getal\r\nBitterheid, maximum (IBU)\r\nSRMmin\r\ngeheel getal\r\nKleur, minimum (SRM)\r\nSRMmax\r\ngeheel getal\r\nKleur, maximum (SRM)\r\nToelichting\r\nVoor het aangeven van de bitterheid wordt in Amerika de IBU (International Bitter Unit) gebruikt en in Europa de EBU (European Bitter Unit). Ze zijn in feite hetzelfde, maar verschillen in de analysemethode waardoor er toch kleine verschillen kunnen zijn.\r\nVoor het aangeven van de kleur van het bier wordt in Amerika de SRM (Standard Reference Method) gebruikt en in Europa de EBC (European Brewery Convention). De EBC waarde is ietsjes minder dan het dubbele van de SRM waarde. Voor de omrekening kun je de volgende formule gebruiken: EBC = 1,97 * SRM.\r\nHet gegevensbestand bjcp_biertypen.csv kun je downloaden en in Excel inlezen. Maar fraaier en beter is het om deze via Power Query als een tabel in een Excel werkblad te laden. Het voordeel hiervan is dat wanneer het gegevensbestand gewijzigd of uitgebreid wordt, je de tabel in Excel met 1 druk op een knop kunt vernieuwen.\r\n\r\nEn om jouw Excel vaardigheden te vergroten kun je mijn gratis online cursus Leer Excel 2016 volgen.\r\nVoor Excel 2016 (365) werkt dit als volgt.[^1]\r\nOpen een (nieuw) Excel bestand.\r\nKies tab Gegevens > Van het web (groep Gegevens ophalen en transformeren)\r\nVul de URL van het bestand in.\r\nKlik op OK.\r\nKlik op Laden.\r\nDe gegevens worden nu als een tabel in een nieuw Excel werkblad geplaatst. Hierna kun je de gegevens gebruiken voor analyses of voor een eigen brouwprogramma in Excel.\r\nOm de gegevens te vernieuwen kies je: tab Gegevens > Alles vernieuwen (groep Query’s en verbindingen).\r\n[1]: Voor Excel 2013 en 2010 moet je eerst de gratis Power Query addin downloaden en installeren.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-01-29T13:56:52+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2019-01-06-invertsuiker/",
    "title": "invertsuiker",
    "description": "Hoe je invertsuiker kunt maken.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2019-01-06",
    "categories": [
      "suiker"
    ],
    "contents": "\r\nBij het maken van likeuren wordt vaak invertsuiker gebruikt omdat deze wat zoeter is dan gewone suiker, waardoor je minder nodig hebt. Ook wordt het gebruikt bij het maken van stookwijn omdat de vergisting wat sneller verloopt. En een enkele keer zie ik wel eens dat een hobbybrouwer het om dezelefde reden gebruikt als bottelsuiker. Ik zelf heb het alleen nog maar gebruikt bij het maken van limoncello en kruidenbitter.\r\nInvertsuiker is een mengsel van gelijke hoeveelheden glucose (druivensuiker) en fructose (vruchtensuiker) en wordt gemaakt uit sacharose (gewone kristalsuiker) door de inwerking van zuren en het enzym sacharase (invertase). Honing is voor het grootste deel invertsuiker. Invertsuiker heeft een aantal voordelen t.o.v. gewone suiker:\r\nHeeft meer zoetkracht (fructose is bijna twee keer zo zoet als saccharose).\r\nKristalliseert minder snel en blijft daardoor zachter.\r\nSmaak is aangenamer en fijner.\r\nOplosbaarheid in alcohol is groter.\r\nWordt sneller door gist in alcohol omgezet.\r\nOm invertsuiker uit gewone suiker te maken moet het saccharosemolekuul (glucose~fructose) gesplitst worden in glucose en fructose. Deze splitsing (hydrolyse) verloopt het beste bij kooktemperatuur in een licht zuur milieu. Het licht zure milieu kun je krijgen door wat citroenzuur (of eventueel citroensap) aan het water toe te voegen.\r\nRecept\r\n1 kg kristalsuiker\r\n0,5 liter water\r\n1 gram citroenzuur (of sap van 1 citroen)\r\nHet water verwarmen en het citroenzuur hierin oplossen. Wanneer het water tegen de kook aan is, de suiker langzaam onder roeren hierin oplossen. Ongeveer 15-20 min. laten koken, dan is alle kristalsuiker omgezet in invertsuiker. Daarna afkoelen. Je hebt dan een (invert)suikersiroop gekregen.\r\nHet kan zijn dat tijdens het koken bruin schuim gevormd wordt. Dit komt door verontreinigingen bij de fabricage van suiker. Dit schuim kun je het beste afscheppen. Eigen gemaakte invertsuikersiroop heeft vaak een lichtgele kleur wat de kwaliteit niet verminderd.\r\nHoewel de eigen gemaakte invertsuikersiroop goed houdbaar is kun je deze het beste toch maar zo snel mogelijk gebruiken omdat de suiker snel kan uitkristalliseren.\r\n\r\n\r\n\r\n",
    "preview": "posts/2019-01-06-invertsuiker/invertsuiker.jpg",
    "last_modified": "2021-04-05T20:24:29+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-12-29-sg-brix-plato/",
    "title": "SG-Brix-Plato",
    "description": "Meeteenheden voor het stamwortgehalte.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2018-12-29",
    "categories": [
      "rekenen"
    ],
    "contents": "\r\nBij het bepalen van de hoeveelheid suiker in wort of bier worden vaak verschillende meetmethodes gebruikt, verschillende maatstaven gehanteerd en eenheden door elkaar gebruikt en omgerekend. In dit artikel worden een aantal definities vastgelegd en formules voor het omrekenen van de meeteenheden gepresenteerd.\r\nDichtheid - Soortelijke massa (Engels: Density)\r\nDichtheid, ook wel soortelijke massa genoemd, is de massa (kg) gedeeld door het volume (m³) van een hoeveelheid stof.\r\n\\(\\rho = \\frac{M}{V}\\)\r\nmet\r\n\\(\\rho\\) = dichtheid (kg/m³)\r\n\\(M\\) = massa (kg)\r\n\\(V\\) = volume (m³)\r\nDe dichtheid is afhankelijk van temperatuur en druk en daarom moeten deze (vooral de temperatuur) erbij vermeld worden. Bij 4°C en 1 atmosfeer druk is de dichtheid van water het grootst en bedraagt 999,972 kg/m³. Gemakshalve wordt hiervoor meestal 1000 genomen.\r\nDichtheid water = 1000 kg/m³ = 1 kg/lit = 1000 gram/lit = 1 gram/ml\r\nDe dichtheid meet je met een hydrometer.\r\nRelatieve Dichtheid (Engels: Specific Gravity, SG)\r\nDit is de dichtheid van een vloeistof gedeeld door de dichtheid van water, beide gemeten bij dezelfde temperatuur en druk. De relatieve dichtheid is daardoor een getal zonder eenheid.\r\n\\(\\text{relatieve dichtheid vloeistof} = \\frac{\\text{dichtheid vloeistof}}{\\text{dichtheid water}}\\)\r\nBij 4°C en 1 atm. geldt dan ook: relatieve dichtheid water = 1.\r\nDe relatieve dichtheid wordt met een hydrometer gemeten.\r\nSoortelijk gewicht\r\nDeze term wordt nog vaak gebruikt om de soortelijke massa aan te geven. Dit is onjuist, het is een verouderde foutieve term want massa is niet hetzelfde als gewicht. Massa is een stofeigenschap die onveranderlijk is. Gewicht is de kracht die de massa uitoefent op de ondergrond onder invloed van de zwaartekracht en wordt uitgedrukt in Newton. Deze kracht is op aarde niet overal hetzelfde. In Nederland oefent een massa van 1 kg een kracht van ongeveer 9,81 Newton uit. Gemakshalve wordt dit vaak afgerond naar 10 Newton.\r\nDe afkorting SG staat in het Nederlands meestal voor Soortelijk Gewicht, terwijl er soortelijke massa bedoeld wordt. In de Engelstalige literatuur staat deze afkorting voor Specific Gravity. Wanneer je in formules de term SG tegenkomt is het dan ook van belang dat je weet wat daar precies mee bedoeld wordt.\r\n\r\nIn de artikelen op deze website wordt met SG steeds de Relatieve dichtheid bedoeld.\r\nSG punten (Engels: Graphical Units, GU)\r\nIn veel brouwprogramma’s wordt met zogenaamde SG punten gewerkt omdat dit vaak handig is bij het rekenen aan bier.\r\n\\(SG_{punten} = Dichtheid_{wort} - Dichtheid_{water}\\)\r\nJe kunt het aantal SG punten ook berekenen uit het SG, en omgekeerd ook. De formules hiervoor zijn:\r\n\\(SG_{punten} = 1000\\times (SG - 1) \\Leftrightarrow SG = \\frac{SG_{punten} + 1000}{1000}\\)\r\nVoor een wort met \\(\\rho =1050\\) gram/liter is \\(SG = 1,050\\) en \\(SG_{punten} = 50\\).\r\nPlato en Balling schalen\r\nBalling heeft voor het eerst tabellen gemaakt waarin het SG gekoppeld wordt aan het massapercentage opgelost extract van sucrose in water. Deze tabellen zijn later door Plato verbeterd. Wortextract bestaat voornamelijk uit suikers verkregen uit de mout, maar bevat ook andere in water oplosbare stoffen.\r\n1 graad Plato = 1 gram sucrose per 100 gram oplossing\r\nDe Plato schaal is via laboratoriumproeven samengesteld. Er is dus geen exacte formule waarmee je SG naar Plato kunt omrekenen en omgekeerd. Hierna volgen een paar goede benaderingsformules. Het gemakkelijkst is het werken met SG punten.\r\nEen redelijke benaderingsformule voor het aantal graden Plato (P) is:\r\nvia SG-punten: \\(P = \\frac{SG_{punten}}{4} \\Leftrightarrow SG_{punten} = 4 \\times P\\)\r\nvia SG: \\(P = 250 \\times (SG - 1) \\Leftrightarrow SG = 1 + \\frac{P}{250}\\)\r\nVoor een wort met \\(SG = 1,050\\) is dan \\(P = \\frac{50}{4} = 12,5\\).\r\nFormules Clerck\r\nDeze is wat nauwkeuriger en zien er als volgt uit:\r\n\\(P = 259 - \\frac{259}{SG} \\Leftrightarrow SG = \\frac{259}{259 - P}\\)\r\n\r\nJe komt ook varianten tegen waarin 259 is vervangen door 260.\r\nVoor een wort met \\(SG = 1,050\\)is dan\\(P = 259 - \\frac{259}{1,050} = 12,333\\).\r\nRegressieformule\r\nVoor een nog grotere nauwkeurigheid, welke zelden nodig is, zijn er regressieformules ontwikkeld. De volgende is daar een voorbeeld van:\r\n\\(P = -676,67 + 1286,4 \\times SG -800,47 \\times SG^2 + 190,74 \\times SG^3\\)\r\nVoor een wort met \\(SG = 1,050\\) is dan \\(P = 12,337\\).\r\nDe volgende regressieformule (helaas zonder bronvermelding) kwam ik in Brewer’s Friend tegen:\r\n\\(P = -616,868 + 1111,14 \\times SG - 630,272 \\times SG^2 + 135,997 \\times SG^3\\)\r\nVoor een wort met \\(SG = 1,050\\) is dan \\(P = 12,388\\).\r\nBrix\r\nBrix is net als Plato, een maat voor de massapercentage extract (de opgeloste stoffen) in wort.\r\n1 graad Brix is 1 gram sucrose per 100 gram oplossing.\r\nDe definities voor Brix en Plato zijn hetzelfde. Er is alleen een zeer klein verschil tussen Brix en Plato in de omrekening naar SG. Dat heeft met de historische ontwikkeling en meetmethode te maken. De oudste schaal hiervoor is Balling, gebaseerd op tabellen van Balling uit 1843. Fouten hierin zijn door Brix gecorrigeerd waardoor de Brix tabellen ontstonden. Verdere verbeteringen hierin hebben geleid tot de Plato schaal. Ook een oorzaak voor kleine verschillen is dat Plato meestal met een hydrometer gemeten wordt en Brix met een refractometer. En omdat wort geen 100% sucrose-oplossing is vindt er een kleine correctie voor de lichtbreking plaats.\r\nVeel gebruikte omrekenformules tussen Brix en Plato zijn:\r\n\\(\\text{Brix} = 1,04 \\times \\text{Plato} \\Leftrightarrow \\text{Plato} = \\text{Brix } / 1,04\\)\r\nIn de literatuur kom je voor de omrekenfactor ook andere waarden dan 1,04 tegen. Deze liggen meestal russen 1,02 en 1,06.\r\nFormules in brouwprogramma’s\r\nWelke formules in de verschillende software programma’s gebruikt worden is niet gedocumenteerd. In de volgende tabel zie je voor een paar brouwprogramma’s de berekende Plato en Brix waarden voor een drietal SG waarden.\r\n\r\nSG = 1,040\r\nSG = 1,050\r\nSG = 1,060\r\nBrouwvisie\r\nP = 10,0 Brix = 10,4\r\nP = 12,4 Brix = 12,9\r\nP = 14,7 Brix = 15,3\r\nBrouwhulp\r\nP = 10,0 Brix = 10,3\r\nP = 12,3 Brix = 12,7\r\nP = 14,7 Brix = 15,1\r\nBeersmith\r\nP = 10,0\r\nP = 12,3\r\nP = 14,7\r\nHet verschil in gebruikte formules verklaart voor een zeer klein deel het verschil in uitkomsten bij de brouwprogramma’s.\r\nExcel werkmap\r\nBij dit artikel is een Excel bestand gemaakt waarin het gebruik van de omrekenformules gedemonstreerd wordt. Tevens zijn er een paar eigen functies ontwikkeld waarmee je eenvoudig het omrekenen kunt uitvoeren. Door dit laatste is het wel een bestand geworden dat macro’s bevat. Bij gebruik van de functies moet dan wel het uitvoeren van macro’s worden toegestaan.\r\nDownload het bestand sg-brix-plato.xlsm en experimenteer hiermee.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-01-29T13:56:52+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-11-29-sierra-nevada-resilience/",
    "title": "Sierra Nevada Resilience",
    "description": "Recept van Sierra Nevada voor ondersteuning slachtoffers bosbranden.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2018-11-29",
    "categories": [
      "recept"
    ],
    "contents": "\r\n\r\n\r\n\r\nDe bekende Sierra Nevada brouwerij in Noord Californie is gespaard gebleven bij de grote bosbranden. Maar veel werknemers en buren zijn wel getroffen. Om deze te helpen is is het Sierra Nevada Camp Fire Relief Fund opgericht en wordt een speciaal bier gebrouwen waarvan alle opbrengst naar het fonds gaat. Ook het recept van dit bier, Sierra Nevada Resilience IPA, is gepubliceerd zodat anderen zich aan kunnen sluiten bij dit initiatief.\r\n\r\n\r\n\r\n",
    "preview": "posts/2018-11-29-sierra-nevada-resilience/sierra_nevada_resilience.png",
    "last_modified": "2021-04-05T20:24:12+02:00",
    "input_file": {},
    "preview_width": 200,
    "preview_height": 121
  },
  {
    "path": "posts/2018-11-26-bkg-biertypenlijst/",
    "title": "BKG Biertypenlijst",
    "description": "De BKG biertypenlijst in een Excel bestand.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2018-11-26",
    "categories": [
      "excel",
      "biertype"
    ],
    "contents": "\r\nUpdate september 2021\r\nDe laatste versie van de BKG biertypenlijst is versie 2.4 van juli 2021. Hierin is als biertype toegevoegd: New England IPA (NEIPA). Deze wijziging is ook doorgevoerd in het hieronder vermelde csv bestand.\r\nUpdate 2 november 2019\r\nBij de keuringen van bieren hanteert het Bier Keurmeesters Gilde (BKG) een lijst met biertypen. Via hun website kun je de BKG Biertypenlijst als pdf bestand downloaden. De huidige versie 2.3 is van augustus 2019.\r\nEr bestaat ook nog een Amerikaanse lijst met biertypen, de zogenaamde BJCP style. De laatste versie is van 2015 en kun je downloaden via BJCP 2015 Style Guidelines. Deze heeft veel meer stijlen gedefinieerd dan het BKG. In de nieuwe versie van de BKG lijst is, indien mogelijk, ook het best bijpassende nummer uit de BJCP lijst opgenomen.\r\nOm de technische kenmerken van de biertypen in een Excel programma te kunnen gebruiken heb ik deze kenmerken in een gestructureerd csv bestand geplaatst. De gebruikte variabelen zijn:\r\nvariabele\r\ngegevenstype\r\ntoelichting\r\nBIERTYPE\r\ntekst\r\nNaam biertype\r\nKLASSE\r\ntekst\r\nA, B, C of D\r\nBEGINSGMIN\r\ngeheel getal\r\nBegin SG, minimum (gram/liter)\r\nBEGINSGMAX\r\ngeheel getal\r\nBegin SG, maximum (gram/liter)\r\nSVGMIN\r\ngeheel getal\r\nSchijnbare vergistingsgraad, minimum (percentage)\r\nSVGMAX\r\ngeheel getal\r\nSchijnbare vergistingsgraad, maximum (percentage)\r\nABVMIN\r\ndecimaal getal\r\nAlcohol volumepercentage, minimum\r\nABVMAX\r\ndecimaal getal\r\nAlcohol volumepercentage, maximum\r\nEBCMIN\r\ngeheel getal\r\nKleur, minimum (EBC)\r\nEBCMAX\r\ngeheel getal\r\nKleur, maximum (EBC)\r\nEBUMIN\r\ngeheel getal\r\nBitterheid, minimum (EBU)\r\nEBUMAX\r\ngeheel getal\r\nBitterheid, maximum (EBU)\r\nCO2MIN\r\ndecimaal getal\r\nKoolzuurgehalte, minimum (gram/liter)\r\nCO2MAX\r\ndecimaal getal\r\nKoolzuurgehalte, maximum (gram/liter)\r\nBJCP\r\ntekst\r\nBJCP style (2015) nummer\r\nIn de lijst komen ook een paar ontbrekende waarden voor omdat de gegevens niet bekend zijn. Daarnaast zijn voor een paar typen bij sommige kenmerken alleen een gemiddelde waarde opgegeven. In dat geval is in de Excel lijst de minimum- en maximumwaarde voor dat kenmerk gelijk gemaakt aan de opgegeven gemiddelde waarde.\r\nHet gegevensbestand bkg_biertypen.csv kun je downloaden en in Excel inlezen. Maar fraaier en beter is het om deze via Power Query als een tabel in een Excel werkblad te laden. Het voordeel hiervan is dat wanneer het gegevensbestand gewijzigd of uitgebreid wordt, je de tabel in Excel met 1 druk op een knop kunt vernieuwen.\r\n\r\nEn om jouw Excel vaardigheden te vergroten kun je mijn gratis online cursus Leer Excel volgen.\r\nVoor Excel 2016 (365) werkt dit als volgt.[^1]\r\nOpen een (nieuw) Excel bestand.\r\nKies tab Gegevens > Van het web (groep Gegevens ophalen en transformeren)\r\nVul de URL van het bestand in.\r\nKlik op OK.\r\nKlik op Laden.\r\nDe gegevens worden nu als een tabel in een nieuw Excel werkblad geplaatst. Hierna kun je de gegevens gebruiken voor analyses of voor een eigen brouwprogramma in Excel.\r\nOm de gegevens te vernieuwen kies je: tab Gegevens > Alles vernieuwen (groep Query’s en verbindingen).\r\nDemo\r\nWanneer je de gegevens eenmaal in een werkblad hebt staan kun je hiermee experimenteren en analyses maken. Als voorbeeld het bestand demo_bkg_biertypen.xlsx waarin de volgende acties zijn uitgevoerd:\r\nLaden van de biertypenlijst naar een tabel in een werkblad.\r\nMaken van twee nieuwe variabelen met de Query Editor.\r\nMaken van twee grafieken die de variatie in alcoholgehalte en bitterheid voor de biertypen tonen.\r\nMaken van twee draaitabellen die de grenzen van het begin SG en EBC waarde voor de vier klassen tonen.\r\nMaken van een draaitabel met draaigrafiek en slicer om het verband tussen het begin SG en alcoholgehalte voor de biertypes te onderzoeken.\r\n[1]: Voor Excel 2013 en 2010 moet je eerst de gratis Power Query addin downloaden en installeren.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-01-29T13:56:52+01:00",
    "input_file": {}
  },
  {
    "path": "posts/2018-10-19-recept/",
    "title": "Hoe kom je aan een recept",
    "description": "Manieren om aan een recept te komen.",
    "author": [
      {
        "name": "Ben Welman",
        "url": {}
      }
    ],
    "date": "2018-10-19",
    "categories": [
      "recept"
    ],
    "contents": "\r\nHoe kom je tot een recept voor een goed en succesvol bier?\r\nIn het begin is dat niet eenvoudig en gebruik je snel een recept van een ander. Zeker wanneer je een volgens dit recept gebrouwen bier geproefd hebt en lekker vindt, kan dit vertrouwen in het recept geven. Soms moet je dan nog wat aan de hoeveelheden veranderen om het recept aan je eigen installatie aan te passen, maar daarna ben je snel klaar en daar is niets mis mee. Zo heb ik in het begin veel gehad aan de Bewezen Recepten op het forum van Hobbybrouwen.nl.\r\nHet wordt wat anders wanneer je een bepaald bier wilt klonen of een bier wilt brouwen dat aan bepaalde kenmerken voldoet. Dan moet je het opstellen van een recept wat systematischer aanpakken. In nog volgend artikelen zal de aanpak hiervan besproken worden.\r\n\r\n\r\n\r\n",
    "preview": "posts/2018-10-19-recept/logoHobbybrouwen-forum.jpg",
    "last_modified": "2021-04-05T20:23:58+02:00",
    "input_file": {}
  }
]
